org/2015-01-17-Swig-杂记.org
#+TITLE: SWIG 杂记
#+AUTHOR: Yang, Ying-chao
#+EMAIL:  yangyingchao[at]gmail[dot]com
#+KEYWORDS: SWIG JNI typemap
#+CATEGORY: Development
#+DESCRIPTION: (nil)
#+OPTIONS:  ^:nil toc:1 H:3 \n:nil ::t |:t ^:{} -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+STARTUP:    align nodlcheck oddeven lognotestate
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+LANGUAGE:   en
#+HTML_HEAD: <style type="text/css">#outline-container-introduction{ clear:both; }</style>
#+LINK_UP:    http://yangyingchao.github.io
#+LINK_HOME:  http://yangyingchao.github.io
#+EXCLUDE_TAGS: noexport


用了两天 [[http://www.swig.org/][SWIG]] 来将 C++ 接口转成 Java 接口，在此简单记录一下用到 =typemap= 解决的几个问题，以
备查询。关于 =typemap= ，可参考 [[http://www.swig.org/Doc1.3/Typemaps.html][官方文档]] 。


* [[../assets/sources/swig/example1.7z][Example1]] Return =byte[]= instead of =std::string=
:PROPERTIES:
:CUSTOM_ID: h:1FD94AD0-06CA-4E7E-A4E5-0D2FEFB8F5CA
:END:

**  C++ Header:
:PROPERTIES:
:CUSTOM_ID: h:8C61C739-C03C-41CF-A525-CED84C2D4959
:END:

 #+BEGIN_SRC c++ -r -n
   #ifndef _EXAMPLE1_H_
   #define _EXAMPLE1_H_
   #include <string>
   class Example1
   {
   public:
       Example1();
       virtual ~Example1();
       std::string GetString();
   };
   #endif /* _EXAMPLE1_H_ */
 #+END_SRC

**  修改的 *SWIG* 接口文件：
:PROPERTIES:
:CUSTOM_ID: h:9B3F1B06-83AC-4E13-9446-3B23FA177BBD
:END:

 #+BEGIN_SRC swig -r -n
   %module exampl1
   %{
   #include "example1.h"
   %}

   %include <std_string.i>

   %typemap(jstype) std::string GetString "byte[]";
   %typemap(jtype) std::string GetString "byte[]";
   %typemap(jni) std::string GetString "jbyteArray";
   %typemap(out) std::string GetString
   {
       if ($1.empty())
       {
           return NULL;
       }

       $result = JCALL1(NewByteArray, jenv, $1.size());
       JCALL4(SetByteArrayRegion, jenv, $result, 0, $1.size(), (const jbyte*)$1.c_str());
   }

   %include "example1.h"

 #+END_SRC

** 生成的文件
:PROPERTIES:
:CUSTOM_ID: h:94905065-DD69-4830-9F81-A87D37F1432C
:END:

*** Java:
:PROPERTIES:
:CUSTOM_ID: h:E4C62352-05EB-4939-8982-C042E135E786
:END:


#+BEGIN_SRC java -r -n
  public class Example1 {
    public Example1() {
      this(exampl1JNI.new_Example1(), true);
    }

    public byte[] GetString() {
      return exampl1JNI.Example1_GetString(swigCPtr, this);
    }
  }
#+END_SRC

*** Java JNI:
:PROPERTIES:
:CUSTOM_ID: h:05A69293-B4A2-4139-8444-AFE5FA02E469
:END:

#+BEGIN_SRC java -r -n
  public class exampl1JNI {
    public final static native long new_Example1();
    public final static native void delete_Example1(long jarg1);
    public final static native byte[] Example1_GetString(long jarg1, Example1 jarg1_);
  }
#+END_SRC

*** JNI Code CPP:
:PROPERTIES:
:CUSTOM_ID: h:64BFE00A-29B2-4D83-8E61-BEFC9BE9F84C
:END:

#+BEGIN_SRC c++ -r -n
  SWIGEXPORT jbyteArray JNICALL Java_exampl1JNI_Example1_1GetString(JNIEnv *jenv, jclass jcls, jlong jarg1, jobject jarg1_) {
      jbyteArray jresult = 0 ;
      Example1 *arg1 = (Example1 *) 0 ;
      std::string result;

      (void)jenv;
      (void)jcls;
      (void)jarg1_;
      arg1 = *(Example1 **)&jarg1;
      result = (arg1)->GetString();
      {
          if ((&result)->empty())
          {
              return NULL;
          }

          jresult = jenv->NewByteArray((&result)->size());
          jenv->SetByteArrayRegion(jresult, 0, (&result)->size(), (const jbyte*)(&result)->c_str());
      }
      return jresult;
  }
#+END_SRC

* [[../assets/sources/swig/example2.7z][Example2: ]]转引用为bytearrary：
:PROPERTIES:
:CUSTOM_ID: h:1784808B-32D3-4C96-9A66-E001550FA3DF
:END:

