_posts/2015-01-17-Swig-杂记.html
---
layout : post
title : SWIG 杂记
categories : Development
tags : SWIG, JNI, typemap
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Example1 Return <code>byte[]</code> instead of <code>std::string</code></a></li>
<li><a href="#sec-2">2. Example2: 转引用为bytearrary：</a></li>
<li><a href="#sec-3">3. Example3: Director</a></li>
</ul>
</div>
</div>
<p>
用了两天 <a href="http://www.swig.org/">SWIG</a> 来将 C++ 接口转成 Java 接口，在此简单记录一下用到 <code>typemap</code> 解决的几个问题，以备查询。关于 <code>typemap</code> ，可参考 <a href="http://www.swig.org/Doc1.3/Typemaps.html">官方文档</a> 。
</p>


<!--more-->
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="../assets/sources/swig/example1.7z">Example1</a> Return <code>byte[]</code> instead of <code>std::string</code></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> C++ Header:</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="linenr"> 1: </span><span style="color: #32cd32;">#if</span><span style="color: #32cd32;">n</span><span style="color: #32cd32;">def</span> _EXAMPLE1_H_
<span class="linenr"> 2: </span><span style="color: #32cd32;">#define</span> <span style="color: #daa520;">_EXAMPLE1_H_</span>
<span class="linenr"> 3: </span><span style="color: #32cd32;">#include</span> <span style="color: #d78700;">&lt;string&gt;</span>
<span class="linenr"> 4: </span><span style="color: #ff4040;">class</span> <span style="color: #32cd32;">Example1</span>
<span class="linenr"> 5: </span>{
<span class="linenr"> 6: </span><span style="color: #ff4040;">public</span>:
<span class="linenr"> 7: </span>    <span style="color: #1e90ff; font-weight: bold;">Example1</span>();
<span class="linenr"> 8: </span>    <span style="color: #ff4040;">virtual</span> ~<span style="color: #1e90ff; font-weight: bold;">Example1</span>();
<span class="linenr"> 9: </span>    <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #1e90ff; font-weight: bold;">GetString</span>();
<span class="linenr">10: </span>};
<span class="linenr">11: </span><span style="color: #32cd32;">#endif</span> <span style="color: #fa8072;">/* </span><span style="color: #cd5c5c; font-style: italic;">_EXAMPLE1_H_ */</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 修改的 <b>SWIG</b> 接口文件：</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-swig"><span class="linenr"> 1: </span><span style="color: #ff4040;">%module</span> <span style="color: #1e90ff; font-weight: bold;">exampl1</span>
<span class="linenr"> 2: </span>%{
<span class="linenr"> 3: </span><span style="color: #32cd32;">#include</span> <span style="color: #d78700;">"example1.h"</span>
<span class="linenr"> 4: </span>%}
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>%<span style="color: #32cd32;">include</span> &lt;std_string.i&gt;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #ff4040;">%typemap</span>(jstype) <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #daa520;">GetString</span> <span style="color: #d78700;">"byte[]"</span>;
<span class="linenr"> 9: </span><span style="color: #ff4040;">%typemap</span>(jtype) <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #daa520;">GetString</span> <span style="color: #d78700;">"byte[]"</span>;
<span class="linenr">10: </span><span style="color: #ff4040;">%typemap</span>(jni) <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #daa520;">GetString</span> <span style="color: #d78700;">"jbyteArray"</span>;
<span class="linenr">11: </span><span style="color: #ff4040;">%typemap</span>(out) <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #daa520;">GetString</span>
<span class="linenr">12: </span>{
<span class="linenr">13: </span>    <span style="color: #ff4040;">if</span> ($1.empty())
<span class="linenr">14: </span>    {
<span class="linenr">15: </span>        <span style="color: #ff4040;">return</span> <span style="color: #7fffd4; font-weight: bold;">NULL</span>;
<span class="linenr">16: </span>    }
<span class="linenr">17: </span>
<span class="linenr">18: </span>    $result = JCALL1(NewByteArray, jenv, $1.size());
<span class="linenr">19: </span>    JCALL4(SetByteArrayRegion, jenv, $result, 0, $1.size(), (<span style="color: #ff4040;">const</span> <span style="color: #32cd32;">jbyte</span>*)$1.c_str());
<span class="linenr">20: </span>}
<span class="linenr">21: </span>
<span class="linenr">22: </span><span style="color: #ff4040;">%include</span> <span style="color: #d78700;">"example1.h"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 生成的文件</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Java:</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-java"><span class="linenr">1: </span><span style="color: #ff4040;">public</span> <span style="color: #ff4040;">class</span> <span style="color: #32cd32;">Example1</span> {
<span class="linenr">2: </span>  <span style="color: #ff4040;">public</span> <span style="color: #1e90ff; font-weight: bold;">Example1</span>() {
<span class="linenr">3: </span>    <span style="color: #ff4040;">this</span>(exampl1JNI.new_Example1(), <span style="color: #7fffd4; font-weight: bold;">true</span>);
<span class="linenr">4: </span>  }
<span class="linenr">5: </span>
<span class="linenr">6: </span>  <span style="color: #ff4040;">public</span> <span style="color: #32cd32;">byte</span>[] <span style="color: #1e90ff; font-weight: bold;">GetString</span>() {
<span class="linenr">7: </span>    <span style="color: #ff4040;">return</span> <span style="color: #7fffd4; font-weight: bold;">exampl1JNI</span>.Example1_GetString(swigCPtr, <span style="color: #ff4040;">this</span>);
<span class="linenr">8: </span>  }
<span class="linenr">9: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Java JNI:</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-java"><span class="linenr">1: </span><span style="color: #ff4040;">public</span> <span style="color: #ff4040;">class</span> <span style="color: #32cd32;">exampl1JNI</span> {
<span class="linenr">2: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">long</span> <span style="color: #1e90ff; font-weight: bold;">new_Example1</span>();
<span class="linenr">3: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">delete_Example1</span>(<span style="color: #32cd32;">long</span> <span style="color: #daa520;">jarg1</span>);
<span class="linenr">4: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">byte</span>[] <span style="color: #1e90ff; font-weight: bold;">Example1_GetString</span>(<span style="color: #32cd32;">long</span> <span style="color: #daa520;">jarg1</span>, <span style="color: #32cd32;">Example1</span> <span style="color: #daa520;">jarg1_</span>);
<span class="linenr">5: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> JNI Code CPP:</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">

<pre class="src src-c++"><span class="linenr"> 1: </span>SWIGEXPORT jbyteArray <span style="color: #32cd32;">JNICALL</span> <span style="color: #1e90ff; font-weight: bold;">Java_exampl1JNI_Example1_1GetString</span>(<span style="color: #32cd32;">JNIEnv</span> *<span style="color: #daa520;">jenv</span>, <span style="color: #32cd32;">jclass</span> <span style="color: #daa520;">jcls</span>, <span style="color: #32cd32;">jlong</span> <span style="color: #daa520;">jarg1</span>, <span style="color: #32cd32;">jobject</span> <span style="color: #daa520;">jarg1_</span><span style="color: #0000ff; background-color: #ff0000; font-weight: bold;">) {</span>
<span class="linenr"> 2: </span>    <span style="color: #32cd32;">jbyteArray</span> <span style="color: #daa520;">jresult</span> = 0 ;
<span class="linenr"> 3: </span>    <span style="color: #32cd32;">Example1</span> *<span style="color: #daa520;">arg1</span> = (<span style="color: #32cd32;">Example1</span> *) 0 ;
<span class="linenr"> 4: </span>    <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #daa520;">result</span>;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>    (<span style="color: #32cd32;">void</span>)jenv;
<span class="linenr"> 7: </span>    (<span style="color: #32cd32;">void</span>)jcls;
<span class="linenr"> 8: </span>    (<span style="color: #32cd32;">void</span>)jarg1_;
<span class="linenr"> 9: </span>    arg1 = *(<span style="color: #32cd32;">Example1</span> **)&amp;jarg1;
<span class="linenr">10: </span>    result = (arg1)-&gt;GetString();
<span class="linenr">11: </span>    {
<span class="linenr">12: </span>        <span style="color: #ff4040;">if</span> ((&amp;result)-&gt;empty())
<span class="linenr">13: </span>        {
<span class="linenr">14: </span>            <span style="color: #ff4040;">return</span> <span style="color: #7fffd4; font-weight: bold;">NULL</span>;
<span class="linenr">15: </span>        }
<span class="linenr">16: </span>
<span class="linenr">17: </span>        jresult = jenv-&gt;NewByteArray((&amp;result)-&gt;size());
<span class="linenr">18: </span>        jenv-&gt;SetByteArrayRegion(jresult, 0, (&amp;result)-&gt;size(), (<span style="color: #ff4040;">const</span> <span style="color: #32cd32;">jbyte</span>*)(&amp;result)-&gt;c_str());
<span class="linenr">19: </span>    }
<span class="linenr">20: </span>    <span style="color: #ff4040;">return</span> jresult;
<span class="linenr">21: </span>}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="../assets/sources/swig/example2.7z">Example2: </a>转引用为bytearrary：</h2>
