org/2015-01-17-Swig-杂记.org
** C++
:PROPERTIES:
:CUSTOM_ID: h:747C9A6A-DA94-4345-927D-2AE3B9AD376E
:END:
#+BEGIN_SRC c++ -r -n
  #ifndef _EXAMPLE1_H_
  #define _EXAMPLE1_H_
  #include <string>
  class Example1
  {
  public:
      void GetString(std::string &out);
  };
  #endif /* _EXAMPLE1_H_ */

#+END_SRC

** SWIG Interface
:PROPERTIES:
:CUSTOM_ID: h:A3BCCDC3-5CE8-42C1-92EC-6FD8500CF199
:END:
#+BEGIN_SRC swig -r -n
  %module exampl1
  %{
  #include "example2.h"
  %}

  %include <std_string.i>

  %typemap(jstype) std::string& out "byte[]";
  %typemap(jtype) std::string& out "byte[]";
  %typemap(jni) std::string& out "jbyteArray";
  %typemap(argout) std::string& out
  {
      if ($1.empty())
      {
          return NULL;
      }

      $result = JCALL1(NewByteArray, jenv, $1.size());
      JCALL4(SetByteArrayRegion, jenv, $result, 0, $1.size(), (const jbyte*)$1.c_str());
  }

  %include "example2.h"
#+END_SRC

** Generated Codes:
:PROPERTIES:
:CUSTOM_ID: h:60E12CB3-D906-42BD-9358-A8887ADC637A
:END:
*** Java Layer
:PROPERTIES:
:CUSTOM_ID: h:0034F063-BF6E-4F2E-BC6E-7EECF9AF3C9D
:END:

#+BEGIN_SRC java -r -n
  public class Example2 {
    private long swigCPtr;
    protected boolean swigCMemOwn;

    protected Example2(long cPtr, boolean cMemoryOwn) {
      swigCMemOwn = cMemoryOwn;
      swigCPtr = cPtr;
    }

    protected static long getCPtr(Example2 obj) {
      return (obj == null) ? 0 : obj.swigCPtr;
    }

    protected void finalize() {
      delete();
    }

    public synchronized void delete() {
      if (swigCPtr != 0) {
        if (swigCMemOwn) {
          swigCMemOwn = false;
          exampl1JNI.delete_Example2(swigCPtr);
        }
        swigCPtr = 0;
      }
    }

    public void GetString(byte[] out) {
      exampl1JNI.Example2_GetString(swigCPtr, this, SWIGTYPE_p_std__string.getCPtr(out));
    }

    public Example2() {
      this(exampl1JNI.new_Example2(), true);
    }

  }

#+END_SRC


*** Java JNI
:PROPERTIES:
:CUSTOM_ID: h:639AF8F9-0492-49C8-ABEF-76CFA5A59285
:END:
#+BEGIN_SRC java -r -n

  public class exampl2JNI {
    public final static native void Example2_GetString(long jarg1, Example2 jarg1_, byte[] jarg2);
    public final static native long new_Example2();
    public final static native void delete_Example2(long jarg1);
  }
#+END_SRC

