_posts/2015-01-17-Swig-杂记.html
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> C++</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="linenr">1: </span><span style="color: #32cd32;">#if</span><span style="color: #32cd32;">n</span><span style="color: #32cd32;">def</span> _EXAMPLE1_H_
<span class="linenr">2: </span><span style="color: #32cd32;">#define</span> <span style="color: #daa520;">_EXAMPLE1_H_</span>
<span class="linenr">3: </span><span style="color: #32cd32;">#include</span> <span style="color: #d78700;">&lt;string&gt;</span>
<span class="linenr">4: </span><span style="color: #ff4040;">class</span> <span style="color: #32cd32;">Example1</span>
<span class="linenr">5: </span>{
<span class="linenr">6: </span><span style="color: #ff4040;">public</span>:
<span class="linenr">7: </span>    <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">GetString</span>(<span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #0000ff; background-color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #daa520;">out</span>);
<span class="linenr">8: </span>};
<span class="linenr">9: </span><span style="color: #32cd32;">#endif</span> <span style="color: #fa8072;">/* </span><span style="color: #cd5c5c; font-style: italic;">_EXAMPLE1_H_ */</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> SWIG Interface</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-swig"><span class="linenr"> 1: </span><span style="color: #ff4040;">%module</span> <span style="color: #1e90ff; font-weight: bold;">exampl1</span>
<span class="linenr"> 2: </span>%{
<span class="linenr"> 3: </span><span style="color: #32cd32;">#include</span> <span style="color: #d78700;">"example2.h"</span>
<span class="linenr"> 4: </span>%}
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>%<span style="color: #32cd32;">include</span> &lt;std_string.i&gt;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #ff4040;">%typemap</span>(jstype) <span style="color: #7fffd4; font-weight: bold;">std</span>::string&amp; out <span style="color: #d78700;">"byte[]"</span>;
<span class="linenr"> 9: </span><span style="color: #ff4040;">%typemap</span>(jtype) <span style="color: #7fffd4; font-weight: bold;">std</span>::string&amp; out <span style="color: #d78700;">"byte[]"</span>;
<span class="linenr">10: </span><span style="color: #ff4040;">%typemap</span>(jni) <span style="color: #7fffd4; font-weight: bold;">std</span>::string&amp; out <span style="color: #d78700;">"jbyteArray"</span>;
<span class="linenr">11: </span><span style="color: #ff4040;">%typemap</span>(argout) <span style="color: #7fffd4; font-weight: bold;">std</span>::string&amp; out
<span class="linenr">12: </span>{
<span class="linenr">13: </span>    <span style="color: #ff4040;">if</span> ($1.empty())
<span class="linenr">14: </span>    {
<span class="linenr">15: </span>        <span style="color: #ff4040;">return</span> <span style="color: #7fffd4; font-weight: bold;">NULL</span>;
<span class="linenr">16: </span>    }
<span class="linenr">17: </span>
<span class="linenr">18: </span>    $result = JCALL1(NewByteArray, jenv, $1.size());
<span class="linenr">19: </span>    JCALL4(SetByteArrayRegion, jenv, $result, 0, $1.size(), (<span style="color: #ff4040;">const</span> <span style="color: #32cd32;">jbyte</span>*)$1.c_str());
<span class="linenr">20: </span>}
<span class="linenr">21: </span>
<span class="linenr">22: </span><span style="color: #ff4040;">%include</span> <span style="color: #d78700;">"example2.h"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Generated Codes:</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Java Layer</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">

<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #ff4040;">public</span> <span style="color: #ff4040;">class</span> <span style="color: #32cd32;">Example2</span> {
<span class="linenr"> 2: </span>  <span style="color: #ff4040;">private</span> <span style="color: #32cd32;">long</span> <span style="color: #daa520;">swigCPtr</span>;
<span class="linenr"> 3: </span>  <span style="color: #ff4040;">protected</span> <span style="color: #32cd32;">boolean</span> <span style="color: #daa520;">swigCMemOwn</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #ff4040;">protected</span> <span style="color: #1e90ff; font-weight: bold;">Example2</span>(<span style="color: #32cd32;">long</span> <span style="color: #daa520;">cPtr</span>, <span style="color: #32cd32;">boolean</span> <span style="color: #daa520;">cMemoryOwn</span>) {
<span class="linenr"> 6: </span>    swigCMemOwn = cMemoryOwn;
<span class="linenr"> 7: </span>    swigCPtr = cPtr;
<span class="linenr"> 8: </span>  }
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>  <span style="color: #ff4040;">protected</span> <span style="color: #ff4040;">static</span> <span style="color: #32cd32;">long</span> <span style="color: #1e90ff; font-weight: bold;">getCPtr</span>(<span style="color: #32cd32;">Example2</span> <span style="color: #daa520;">obj</span>) {
<span class="linenr">11: </span>    <span style="color: #ff4040;">return</span> (obj == <span style="color: #7fffd4; font-weight: bold;">null</span>) ? 0 : obj.swigCPtr;
<span class="linenr">12: </span>  }
<span class="linenr">13: </span>
<span class="linenr">14: </span>  <span style="color: #ff4040;">protected</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">finalize</span>() {
<span class="linenr">15: </span>    delete();
<span class="linenr">16: </span>  }
<span class="linenr">17: </span>
<span class="linenr">18: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">synchronized</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">delete</span>() {
<span class="linenr">19: </span>    <span style="color: #ff4040;">if</span> (swigCPtr != 0) {
<span class="linenr">20: </span>      <span style="color: #ff4040;">if</span> (swigCMemOwn) {
<span class="linenr">21: </span>        swigCMemOwn = <span style="color: #7fffd4; font-weight: bold;">false</span>;
<span class="linenr">22: </span>        exampl1JNI.delete_Example2(swigCPtr);
<span class="linenr">23: </span>      }
<span class="linenr">24: </span>      swigCPtr = 0;
<span class="linenr">25: </span>    }
<span class="linenr">26: </span>  }
<span class="linenr">27: </span>
<span class="linenr">28: </span>  <span style="color: #ff4040;">public</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">GetString</span>(<span style="color: #32cd32;">byte</span>[] <span style="color: #daa520;">out</span>) {
<span class="linenr">29: </span>    <span style="color: #7fffd4; font-weight: bold;">exampl1JNI</span>.Example2_GetString(swigCPtr, <span style="color: #ff4040;">this</span>, SWIGTYPE_p_std__string.getCPtr(out));
<span class="linenr">30: </span>  }
<span class="linenr">31: </span>
<span class="linenr">32: </span>  <span style="color: #ff4040;">public</span> <span style="color: #1e90ff; font-weight: bold;">Example2</span>() {
<span class="linenr">33: </span>    <span style="color: #ff4040;">this</span>(exampl1JNI.new_Example2(), <span style="color: #7fffd4; font-weight: bold;">true</span>);
<span class="linenr">34: </span>  }
<span class="linenr">35: </span>
<span class="linenr">36: </span>}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Java JNI</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">

<pre class="src src-java"><span class="linenr">1: </span><span style="color: #ff4040;">public</span> <span style="color: #ff4040;">class</span> <span style="color: #32cd32;">exampl2JNI</span> {
<span class="linenr">2: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">Example2_GetString</span>(<span style="color: #32cd32;">long</span> <span style="color: #daa520;">jarg1</span>, <span style="color: #32cd32;">Example2</span> <span style="color: #daa520;">jarg1_</span>, <span style="color: #32cd32;">byte</span>[] <span style="color: #daa520;">jarg2</span>);
<span class="linenr">3: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">long</span> <span style="color: #1e90ff; font-weight: bold;">new_Example2</span>();
<span class="linenr">4: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">delete_Example2</span>(<span style="color: #32cd32;">long</span> <span style="color: #daa520;">jarg1</span>);
<span class="linenr">5: </span>}
</pre>
</div>
</div>
</div>
