org/2015-01-17-Swig-杂记.org
*** C++ JNI:
:PROPERTIES:
:CUSTOM_ID: h:01580B1C-06F3-4F5A-A4DB-D7B01C1D2CCC
:END:
#+BEGIN_SRC c++ -r -n
  SWIGEXPORT void JNICALL Java_exampl2JNI_Example2_1GetString(JNIEnv *jenv, jclass jcls, jlong jarg1, jobject jarg1_, jbyteArray jarg2) {
      Example2 *arg1 = (Example2 *) 0 ;
      std::string *arg2 = 0 ;

      (void)jenv;
      (void)jcls;
      (void)jarg1_;
      arg1 = *(Example2 **)&jarg1;
      arg2 = *(std::string **)&jarg2;
      if (!arg2) {
          SWIG_JavaThrowException(jenv, SWIG_JavaNullPointerException, "std::string & reference is null");
          return ;
      }
      (arg1)->GetString(*arg2);
      {
          if ((&arg2)->empty())
          {
              return NULL;
          }

          jresult = jenv->NewByteArray((&arg2)->size());
          jenv->SetByteArrayRegion(jresult, 0, (&arg2)->size(), (const jbyte*)(&arg2)->c_str());
      }
  }

#+END_SRC

* [[../assets/sources/swig/example3.7z][Example3: ]]Director
:PROPERTIES:
:CUSTOM_ID: h:55C0E9CC-2A3F-4232-8444-F01D292C70C3
:END:

** C++
:PROPERTIES:
:CUSTOM_ID: h:B44EFC57-B9A0-4DD1-8C4F-5DE96E1C1CC2
:END:

#+BEGIN_SRC c++ -r -n
  #include <string>
  class Example3
  {
  public:
      virtual ~Example3() {}
      virtual void Updated(const std::string& o, const std::string& n) = 0;
  };
#+END_SRC

** SWIG Interface
:PROPERTIES:
:CUSTOM_ID: h:704C4E2D-BDC6-42FA-B04A-45DB1E2DB414
:END:
#+BEGIN_SRC swig -r -n
%module (directors="1") exampl3
%{
#include "example3.h"
%}

%include <std_string.i>

%feature("director") Example3;

%typemap(jtype) const std::string& o "byte[]"
%typemap(jtype) const std::string& n "byte[]"
%typemap(jstype) const std::string& o "byte[]"
%typemap(jstype) const std::string& n "byte[]"
%typemap(jni) const std::string& o "jbyteArray"
%typemap(jni) const std::string& n "jbyteArray"

%typemap(directorin,descriptor="[b") const std::string&
{
    if ($1.empty())
    {
        return NULL;
    }

    $input = JCALL1(NewByteArray, jenv, $1.size());
    JCALL4(SetByteArrayRegion, jenv, $result, 0, $1.size(), (const jbyte*)$1.c_str());
}

%typemap(in) const std::string& // we can add variable names to narrow down pattern matching.
{
    jbyte* dataPtr = (jbyte*)JCALL(env->GetByteArrayElements($input, 0));
    jsize  dataSize = JCALL11(env->GetArrayLength($input));
    if (olddata && dataSize)
    {
        $1 = std::string(dataPtr, dataSize);
    }
}

%include "example3.h"
#+END_SRC

** Generated Codes:
:PROPERTIES:
:CUSTOM_ID: h:BC24391F-A931-400D-8EF0-67AAABA69C40
:END:

