_posts/2015-01-17-Swig-杂记.html

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> C++ JNI:</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">

<pre class="src src-c++"><span class="linenr"> 1: </span>SWIGEXPORT <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">JNICALL</span> Java_exampl2JNI_Example2_1GetString(<span style="color: #32cd32;">JNIEnv</span> *<span style="color: #daa520;">jenv</span>, <span style="color: #32cd32;">jclass</span> <span style="color: #daa520;">jcls</span>, <span style="color: #32cd32;">jlong</span> <span style="color: #daa520;">jarg1</span>, <span style="color: #32cd32;">jobject</span> <span style="color: #daa520;">jarg1_</span>, <span style="color: #32cd32;">jbyteArray</span><span style="color: #0000ff; background-color: #ff0000; font-weight: bold;"> jarg2) {</span>
<span class="linenr"> 2: </span>    <span style="color: #32cd32;">Example2</span> *<span style="color: #daa520;">arg1</span> = (<span style="color: #32cd32;">Example2</span> *) 0 ;
<span class="linenr"> 3: </span>    <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> *<span style="color: #daa520;">arg2</span> = 0 ;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    (<span style="color: #32cd32;">void</span>)jenv;
<span class="linenr"> 6: </span>    (<span style="color: #32cd32;">void</span>)jcls;
<span class="linenr"> 7: </span>    (<span style="color: #32cd32;">void</span>)jarg1_;
<span class="linenr"> 8: </span>    arg1 = *(<span style="color: #32cd32;">Example2</span> **)&amp;jarg1;
<span class="linenr"> 9: </span>    arg2 = *(<span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> **)&amp;jarg2;
<span class="linenr">10: </span>    <span style="color: #ff4040;">if</span> (!arg2) {
<span class="linenr">11: </span>        SWIG_JavaThrowException(jenv, SWIG_JavaNullPointerException, <span style="color: #d78700;">"std::string &amp; reference is null"</span>);
<span class="linenr">12: </span>        <span style="color: #ff4040;">return</span> ;
<span class="linenr">13: </span>    }
<span class="linenr">14: </span>    (arg1)-&gt;GetString(*arg2);
<span class="linenr">15: </span>    {
<span class="linenr">16: </span>        <span style="color: #ff4040;">if</span> ((&amp;arg2)-&gt;empty())
<span class="linenr">17: </span>        {
<span class="linenr">18: </span>            <span style="color: #ff4040;">return</span> <span style="color: #7fffd4; font-weight: bold;">NULL</span>;
<span class="linenr">19: </span>        }
<span class="linenr">20: </span>
<span class="linenr">21: </span>        jresult = jenv-&gt;NewByteArray((&amp;arg2)-&gt;size());
<span class="linenr">22: </span>        jenv-&gt;SetByteArrayRegion(jresult, 0, (&amp;arg2)-&gt;size(), (<span style="color: #ff4040;">const</span> <span style="color: #32cd32;">jbyte</span>*)(&amp;arg2)-&gt;c_str());
<span class="linenr">23: </span>    }
<span class="linenr">24: </span>}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="../assets/sources/swig/example3.7z">Example3: </a>Director</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> C++</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="linenr">1: </span><span style="color: #32cd32;">#include</span> <span style="color: #d78700;">&lt;string&gt;</span>
<span class="linenr">2: </span><span style="color: #ff4040;">class</span> <span style="color: #32cd32;">Example3</span>
<span class="linenr">3: </span>{
<span class="linenr">4: </span><span style="color: #ff4040;">public</span>:
<span class="linenr">5: </span>    <span style="color: #ff4040;">virtual</span> ~<span style="color: #1e90ff; font-weight: bold;">Example3</span>() {}
<span class="linenr">6: </span>    <span style="color: #ff4040;">virtual</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">Updated</span>(<span style="color: #ff4040;">const</span> <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span><span style="color: #0000ff; background-color: #ff0000; font-weight: bold;">&amp;</span> <span style="color: #daa520;">o</span>, <span style="color: #ff4040;">const</span> <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span><span style="color: #0000ff; background-color: #ff0000; font-weight: bold;">&amp;</span> <span style="color: #daa520;">n</span>) = 0;
<span class="linenr">7: </span>};
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> SWIG Interface</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-swig"><span class="linenr"> 1: </span><span style="color: #ff4040;">%module</span> (directors=<span style="color: #d78700;">"1"</span>) exampl3
<span class="linenr"> 2: </span>%{
<span class="linenr"> 3: </span><span style="color: #32cd32;">#include</span> <span style="color: #d78700;">"example3.h"</span>
<span class="linenr"> 4: </span>%}
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>%<span style="color: #32cd32;">include</span> &lt;std_string.i&gt;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #ff4040;">%feature</span>(<span style="color: #d78700;">"director"</span>) Example3;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #ff4040;">%typemap</span>(jtype) <span style="color: #ff4040;">const</span> <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span>&amp; <span style="color: #1e90ff; font-weight: bold;">o</span> <span style="color: #d78700;">"byte[]"</span>
<span class="linenr">11: </span><span style="color: #ff4040;">%typemap</span>(jtype) <span style="color: #ff4040;">const</span> <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span>&amp; <span style="color: #1e90ff; font-weight: bold;">n</span> <span style="color: #d78700;">"byte[]"</span>
<span class="linenr">12: </span><span style="color: #ff4040;">%typemap</span>(jstype) <span style="color: #ff4040;">const</span> <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span>&amp; <span style="color: #1e90ff; font-weight: bold;">o</span> <span style="color: #d78700;">"byte[]"</span>
<span class="linenr">13: </span><span style="color: #ff4040;">%typemap</span>(jstype) <span style="color: #ff4040;">const</span> <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span>&amp; <span style="color: #1e90ff; font-weight: bold;">n</span> <span style="color: #d78700;">"byte[]"</span>
<span class="linenr">14: </span><span style="color: #ff4040;">%typemap</span>(jni) <span style="color: #ff4040;">const</span> <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span>&amp; <span style="color: #1e90ff; font-weight: bold;">o</span> <span style="color: #d78700;">"jbyteArray"</span>
<span class="linenr">15: </span><span style="color: #ff4040;">%typemap</span>(jni) <span style="color: #ff4040;">const</span> <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span>&amp; <span style="color: #1e90ff; font-weight: bold;">n</span> <span style="color: #d78700;">"jbyteArray"</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span><span style="color: #ff4040;">%typemap</span>(directorin,descriptor=<span style="color: #d78700;">"[b"</span>) <span style="color: #ff4040;">const</span> <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span>&amp;
<span class="linenr">18: </span>{
<span class="linenr">19: </span>    <span style="color: #ff4040;">if</span> ($1.empty())
<span class="linenr">20: </span>    {
<span class="linenr">21: </span>        <span style="color: #ff4040;">return</span> <span style="color: #7fffd4; font-weight: bold;">NULL</span>;
<span class="linenr">22: </span>    }
<span class="linenr">23: </span>
<span class="linenr">24: </span>    $input = JCALL1(NewByteArray, jenv, $1.size());
<span class="linenr">25: </span>    JCALL4(SetByteArrayRegion, jenv, $result, 0, $1.size(), (<span style="color: #ff4040;">const</span> <span style="color: #32cd32;">jbyte</span>*)$1.c_str());
<span class="linenr">26: </span>}
<span class="linenr">27: </span>
<span class="linenr">28: </span><span style="color: #ff4040;">%typemap</span>(in) <span style="color: #ff4040;">const</span> <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span>&amp; <span style="color: #fa8072;">// </span><span style="color: #cd5c5c; font-style: italic;">we can add variable names to narrow down pattern matching.</span>
<span class="linenr">29: </span>{
<span class="linenr">30: </span>    <span style="color: #32cd32;">jbyte</span>* <span style="color: #daa520;">dataPtr</span> = (<span style="color: #32cd32;">jbyte</span>*)<span style="color: #32cd32;">JCALL</span>(env-&gt;GetByteArrayElements($input, 0));
<span class="linenr">31: </span>    <span style="color: #32cd32;">jsize</span>  <span style="color: #daa520;">dataSize</span> = JCALL11(env-&gt;GetArrayLength($input));
<span class="linenr">32: </span>    <span style="color: #ff4040;">if</span> (olddata &amp;&amp; dataSize)
<span class="linenr">33: </span>    {
<span class="linenr">34: </span>        $1 = <span style="color: #7fffd4; font-weight: bold;">std</span>::string(dataPtr, dataSize);
<span class="linenr">35: </span>    }
<span class="linenr">36: </span>}
<span class="linenr">37: </span>
<span class="linenr">38: </span><span style="color: #ff4040;">%include</span> <span style="color: #d78700;">"example3.h"</span>
</pre>
</div>
</div>
</div>
