org/2015-01-17-Swig-杂记.org
*** Java
:PROPERTIES:
:CUSTOM_ID: h:FC57685B-5C7F-48C2-AAED-BF1118350BB6
:END:

#+BEGIN_SRC java -r -n
  public class Example3 {
    private long swigCPtr;
    protected boolean swigCMemOwn;

    protected Example3(long cPtr, boolean cMemoryOwn) {
      swigCMemOwn = cMemoryOwn;
      swigCPtr = cPtr;
    }

    protected static long getCPtr(Example3 obj) {
      return (obj == null) ? 0 : obj.swigCPtr;
    }

    public synchronized void delete() {
      if (swigCPtr != 0) {
        if (swigCMemOwn) {
          swigCMemOwn = false;
          throw new UnsupportedOperationException("C++ destructor does not have public access");
        }
        swigCPtr = 0;
      }
    }

    protected void swigDirectorDisconnect() {
      swigCMemOwn = false;
      delete();
    }

    public void swigReleaseOwnership() {
      swigCMemOwn = false;
      exampl3JNI.Example3_change_ownership(this, swigCPtr, false);
    }

    public void swigTakeOwnership() {
      swigCMemOwn = true;
      exampl3JNI.Example3_change_ownership(this, swigCPtr, true);
    }

    public void Updated(byte[] o, byte[] n) {
      exampl3JNI.Example3_Updated(swigCPtr, this, o, n);
    }

    public Example3() {
      this(exampl3JNI.new_Example3(), true);
      exampl3JNI.Example3_director_connect(this, swigCPtr, swigCMemOwn, true);
    }

  }

#+END_SRC

*** Java JNI
:PROPERTIES:
:CUSTOM_ID: h:7450D73C-3619-4871-97A7-3D569FDCEA6F
:END:
#+BEGIN_SRC java -r -n
public class exampl3JNI {
  public final static native void Example3_Updated(long jarg1, Example3 jarg1_, byte[] jarg2, byte[] jarg3);
  public final static native long new_Example3();
  public final static native void Example3_director_connect(Example3 obj, long cptr, boolean mem_own, boolean weak_global);
  public final static native void Example3_change_ownership(Example3 obj, long cptr, boolean take_or_release);

  public static void SwigDirector_Example3_Updated(Example3 self, byte[] o, byte[] n) {
    self.Updated(o, n);
  }

  private final static native void swig_module_init();
  static {
    swig_module_init();
  }
}

#+END_SRC

