_posts/2015-01-17-Swig-杂记.html

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Generated Codes:</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Java</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">

<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #ff4040;">public</span> <span style="color: #ff4040;">class</span> <span style="color: #32cd32;">Example3</span> {
<span class="linenr"> 2: </span>  <span style="color: #ff4040;">private</span> <span style="color: #32cd32;">long</span> <span style="color: #daa520;">swigCPtr</span>;
<span class="linenr"> 3: </span>  <span style="color: #ff4040;">protected</span> <span style="color: #32cd32;">boolean</span> <span style="color: #daa520;">swigCMemOwn</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #ff4040;">protected</span> <span style="color: #1e90ff; font-weight: bold;">Example3</span>(<span style="color: #32cd32;">long</span> <span style="color: #daa520;">cPtr</span>, <span style="color: #32cd32;">boolean</span> <span style="color: #daa520;">cMemoryOwn</span>) {
<span class="linenr"> 6: </span>    swigCMemOwn = cMemoryOwn;
<span class="linenr"> 7: </span>    swigCPtr = cPtr;
<span class="linenr"> 8: </span>  }
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>  <span style="color: #ff4040;">protected</span> <span style="color: #ff4040;">static</span> <span style="color: #32cd32;">long</span> <span style="color: #1e90ff; font-weight: bold;">getCPtr</span>(<span style="color: #32cd32;">Example3</span> <span style="color: #daa520;">obj</span>) {
<span class="linenr">11: </span>    <span style="color: #ff4040;">return</span> (obj == <span style="color: #7fffd4; font-weight: bold;">null</span>) ? 0 : obj.swigCPtr;
<span class="linenr">12: </span>  }
<span class="linenr">13: </span>
<span class="linenr">14: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">synchronized</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">delete</span>() {
<span class="linenr">15: </span>    <span style="color: #ff4040;">if</span> (swigCPtr != 0) {
<span class="linenr">16: </span>      <span style="color: #ff4040;">if</span> (swigCMemOwn) {
<span class="linenr">17: </span>        swigCMemOwn = <span style="color: #7fffd4; font-weight: bold;">false</span>;
<span class="linenr">18: </span>        <span style="color: #ff4040;">throw</span> <span style="color: #ff4040;">new</span> <span style="color: #32cd32;">UnsupportedOperationException</span>(<span style="color: #d78700;">"C++ destructor does not have public access"</span>);
<span class="linenr">19: </span>      }
<span class="linenr">20: </span>      swigCPtr = 0;
<span class="linenr">21: </span>    }
<span class="linenr">22: </span>  }
<span class="linenr">23: </span>
<span class="linenr">24: </span>  <span style="color: #ff4040;">protected</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">swigDirectorDisconnect</span>() {
<span class="linenr">25: </span>    swigCMemOwn = <span style="color: #7fffd4; font-weight: bold;">false</span>;
<span class="linenr">26: </span>    delete();
<span class="linenr">27: </span>  }
<span class="linenr">28: </span>
<span class="linenr">29: </span>  <span style="color: #ff4040;">public</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">swigReleaseOwnership</span>() {
<span class="linenr">30: </span>    swigCMemOwn = <span style="color: #7fffd4; font-weight: bold;">false</span>;
<span class="linenr">31: </span>    <span style="color: #7fffd4; font-weight: bold;">exampl3JNI</span>.Example3_change_ownership(<span style="color: #ff4040;">this</span>, swigCPtr, <span style="color: #7fffd4; font-weight: bold;">false</span>);
<span class="linenr">32: </span>  }
<span class="linenr">33: </span>
<span class="linenr">34: </span>  <span style="color: #ff4040;">public</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">swigTakeOwnership</span>() {
<span class="linenr">35: </span>    swigCMemOwn = <span style="color: #7fffd4; font-weight: bold;">true</span>;
<span class="linenr">36: </span>    <span style="color: #7fffd4; font-weight: bold;">exampl3JNI</span>.Example3_change_ownership(<span style="color: #ff4040;">this</span>, swigCPtr, <span style="color: #7fffd4; font-weight: bold;">true</span>);
<span class="linenr">37: </span>  }
<span class="linenr">38: </span>
<span class="linenr">39: </span>  <span style="color: #ff4040;">public</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">Updated</span>(<span style="color: #32cd32;">byte</span>[] <span style="color: #daa520;">o</span>, <span style="color: #32cd32;">byte</span>[] <span style="color: #daa520;">n</span>) {
<span class="linenr">40: </span>    <span style="color: #7fffd4; font-weight: bold;">exampl3JNI</span>.Example3_Updated(swigCPtr, <span style="color: #ff4040;">this</span>, o, n);
<span class="linenr">41: </span>  }
<span class="linenr">42: </span>
<span class="linenr">43: </span>  <span style="color: #ff4040;">public</span> <span style="color: #1e90ff; font-weight: bold;">Example3</span>() {
<span class="linenr">44: </span>    <span style="color: #ff4040;">this</span>(exampl3JNI.new_Example3(), <span style="color: #7fffd4; font-weight: bold;">true</span>);
<span class="linenr">45: </span>    <span style="color: #7fffd4; font-weight: bold;">exampl3JNI</span>.Example3_director_connect(<span style="color: #ff4040;">this</span>, swigCPtr, swigCMemOwn, <span style="color: #7fffd4; font-weight: bold;">true</span>);
<span class="linenr">46: </span>  }
<span class="linenr">47: </span>
<span class="linenr">48: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Java JNI</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">

<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #ff4040;">public</span> <span style="color: #ff4040;">class</span> <span style="color: #32cd32;">exampl3JNI</span> {
<span class="linenr"> 2: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">Example3_Updated</span>(<span style="color: #32cd32;">long</span> <span style="color: #daa520;">jarg1</span>, <span style="color: #32cd32;">Example3</span> <span style="color: #daa520;">jarg1_</span>, <span style="color: #32cd32;">byte</span>[] <span style="color: #daa520;">jarg2</span>, <span style="color: #32cd32;">byte</span>[] <span style="color: #daa520;">jarg3</span>);
<span class="linenr"> 3: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">long</span> <span style="color: #1e90ff; font-weight: bold;">new_Example3</span>();
<span class="linenr"> 4: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">Example3_director_connect</span>(<span style="color: #32cd32;">Example3</span> <span style="color: #daa520;">obj</span>, <span style="color: #32cd32;">long</span> <span style="color: #daa520;">cptr</span>, <span style="color: #32cd32;">boolean</span> <span style="color: #daa520;">mem_own</span>, <span style="color: #32cd32;">boolean</span> <span style="color: #daa520;">weak_global</span><span style="color: #0000ff; background-color: #ff0000; font-weight: bold;">);</span>
<span class="linenr"> 5: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">Example3_change_ownership</span>(<span style="color: #32cd32;">Example3</span> <span style="color: #daa520;">obj</span>, <span style="color: #32cd32;">long</span> <span style="color: #daa520;">cptr</span>, <span style="color: #32cd32;">boolean</span> <span style="color: #daa520;">take_or_release</span>);
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span style="color: #ff4040;">public</span> <span style="color: #ff4040;">static</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">SwigDirector_Example3_Updated</span>(<span style="color: #32cd32;">Example3</span> <span style="color: #daa520;">self</span>, <span style="color: #32cd32;">byte</span>[] <span style="color: #daa520;">o</span>, <span style="color: #32cd32;">byte</span>[] <span style="color: #daa520;">n</span>) {
<span class="linenr"> 8: </span>    <span style="color: #7fffd4; font-weight: bold;">self</span>.Updated(o, n);
<span class="linenr"> 9: </span>  }
<span class="linenr">10: </span>
<span class="linenr">11: </span>  <span style="color: #ff4040;">private</span> <span style="color: #ff4040;">final</span> <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">native</span> <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">swig_module_init</span>();
<span class="linenr">12: </span>  <span style="color: #ff4040;">static</span> {
<span class="linenr">13: </span>    swig_module_init();
<span class="linenr">14: </span>  }
<span class="linenr">15: </span>}
</pre>
</div>
</div>
</div>
