org/2015-01-17-Swig-杂记.org
*** C++ Wrapper
:PROPERTIES:
:CUSTOM_ID: h:2A86BD78-6DED-4114-85D3-60307B042001
:END:
#+BEGIN_SRC c++ -r -n
  void SwigDirector_Example3::Updated(std::string const &o, std::string const &n) {
      JNIEnvWrapper swigjnienv(this) ;
      JNIEnv * jenv = swigjnienv.getJNIEnv() ;
      jobject swigjobj = (jobject) NULL ;
      jbyteArray jo = 0 ;
      jbyteArray jn = 0 ;

      if (!swig_override[0]) {
          SWIG_JavaThrowException(JNIEnvWrapper(this).getJNIEnv(), SWIG_JavaDirectorPureVirtual, "Attempted to invoke pure virtual method Example3::Updated.");
          return;
      }
      swigjobj = swig_get_self(jenv);
      if (swigjobj && jenv->IsSameObject(swigjobj, NULL) == JNI_FALSE) {
          {
              if ((&o)->empty())
              {
                  return NULL;
              }

              jo = jenv->NewByteArray((&o)->size());
              jenv->SetByteArrayRegion($result, 0, (&o)->size(), (const jbyte*)(&o)->c_str());
          }
          {
              if ((&n)->empty())
              {
                  return NULL;
              }

              jn = jenv->NewByteArray((&n)->size());
              jenv->SetByteArrayRegion($result, 0, (&n)->size(), (const jbyte*)(&n)->c_str());
          }
          jenv->CallStaticVoidMethod(Swig::jclass_exampl3JNI, Swig::director_methids[0], swigjobj, jo, jn);
          if (jenv->ExceptionCheck() == JNI_TRUE) return ;
      } else {
          SWIG_JavaThrowException(jenv, SWIG_JavaNullPointerException, "null upcall object");
      }
      if (swigjobj) jenv->DeleteLocalRef(swigjobj);
  }


  #ifdef __cplusplus
  extern "C" {
  #endif

  SWIGEXPORT void JNICALL Java_exampl3JNI_Example3_1Updated(JNIEnv *jenv, jclass jcls, jlong jarg1, jobject jarg1_, jbyteArray jarg2, jbyteArray jarg3) {
      Example3 *arg1 = (Example3 *) 0 ;
      std::string *arg2 = 0 ;
      std::string *arg3 = 0 ;

      (void)jenv;
      (void)jcls;
      (void)jarg1_;
      arg1 = *(Example3 **)&jarg1;
      {
          jbyte* dataPtr = (jbyte*)JCALL(env->GetByteArrayElements(jarg2, 0));
          jsize  dataSize = JCALL11(env->GetArrayLength(jarg2));
          if (olddata && dataSize)
          {
              arg2 = std::string(dataPtr, dataSize);
          }
      }
      {
          jbyte* dataPtr = (jbyte*)JCALL(env->GetByteArrayElements(jarg3, 0));
          jsize  dataSize = JCALL11(env->GetArrayLength(jarg3));
          if (olddata && dataSize)
          {
              arg3 = std::string(dataPtr, dataSize);
          }
      }
      (arg1)->Updated((std::string const &)*arg2,(std::string const &)*arg3);
  }

  SWIGEXPORT void JNICALL Java_exampl3JNI_swig_1module_1init(JNIEnv *jenv, jclass jcls) {
      int i;

      static struct {
          const char *method;
          const char *signature;
      } methods[1] = {
          {
              "SwigDirector_Example3_Updated", "(LExample3;[B[B)V"
          }
      };
      Swig::jclass_exampl3JNI = (jclass) jenv->NewGlobalRef(jcls);
      if (!Swig::jclass_exampl3JNI) return;
      for (i = 0; i < (int) (sizeof(methods)/sizeof(methods[0])); ++i) {
          Swig::director_methids[i] = jenv->GetStaticMethodID(jcls, methods[i].method, methods[i].signature);
          if (!Swig::director_methids[i]) return;
      }
  }


  #ifdef __cplusplus
  }
  #endif


#+END_SRC
