_posts/2015-01-17-Swig-杂记.html

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> C++ Wrapper</h4>
<div class="outline-text-4" id="text-3-3-3">
<div class="org-src-container">

<pre class="src src-c++"><span class="linenr"> 1: </span><span style="color: #32cd32;">void</span> <span style="color: #7fffd4; font-weight: bold;">SwigDirector_Example3</span>::<span style="color: #1e90ff; font-weight: bold;">Updated</span>(<span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #ff4040;">const</span> <span style="color: #0000ff; background-color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #daa520;">o</span>, <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #ff4040;">const</span> <span style="color: #0000ff; background-color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #daa520;">n</span>) {
<span class="linenr"> 2: </span>    <span style="color: #32cd32;">JNIEnvWrapper</span> <span style="color: #daa520;">swigjnienv</span>(<span style="color: #ff4040;">this</span>) ;
<span class="linenr"> 3: </span>    <span style="color: #32cd32;">JNIEnv</span> * <span style="color: #daa520;">jenv</span> = swigjnienv.getJNIEnv() ;
<span class="linenr"> 4: </span>    <span style="color: #32cd32;">jobject</span> <span style="color: #daa520;">swigjobj</span> = (jobject) <span style="color: #7fffd4; font-weight: bold;">NULL</span> ;
<span class="linenr"> 5: </span>    <span style="color: #32cd32;">jbyteArray</span> <span style="color: #daa520;">jo</span> = 0 ;
<span class="linenr"> 6: </span>    <span style="color: #32cd32;">jbyteArray</span> <span style="color: #daa520;">jn</span> = 0 ;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #ff4040;">if</span> (!swig_override[0]) {
<span class="linenr"> 9: </span>        SWIG_JavaThrowException(JNIEnvWrapper(<span style="color: #ff4040;">this</span>).getJNIEnv(), SWIG_JavaDirectorPureVirtual, <span style="color: #d78700;">"Attempted to invoke pure</span><span style="color: #0000ff; background-color: #ff0000; font-weight: bold;"> virtual method Example3::Updated.");</span>
<span class="linenr">10: </span>        <span style="color: #ff4040;">return</span>;
<span class="linenr">11: </span>    }
<span class="linenr">12: </span>    swigjobj = swig_get_self(jenv);
<span class="linenr">13: </span>    <span style="color: #ff4040;">if</span> (swigjobj &amp;&amp; jenv-&gt;IsSameObject(swigjobj, <span style="color: #7fffd4; font-weight: bold;">NULL</span>) == JNI_FALSE) {
<span class="linenr">14: </span>        {
<span class="linenr">15: </span>            <span style="color: #ff4040;">if</span> ((&amp;o)-&gt;empty())
<span class="linenr">16: </span>            {
<span class="linenr">17: </span>                <span style="color: #ff4040;">return</span> <span style="color: #7fffd4; font-weight: bold;">NULL</span>;
<span class="linenr">18: </span>            }
<span class="linenr">19: </span>
<span class="linenr">20: </span>            jo = jenv-&gt;NewByteArray((&amp;o)-&gt;size());
<span class="linenr">21: </span>            jenv-&gt;SetByteArrayRegion($result, 0, (&amp;o)-&gt;size(), (<span style="color: #ff4040;">const</span> <span style="color: #32cd32;">jbyte</span>*)(&amp;o)-&gt;c_str());
<span class="linenr">22: </span>        }
<span class="linenr">23: </span>        {
<span class="linenr">24: </span>            <span style="color: #ff4040;">if</span> ((&amp;n)-&gt;empty())
<span class="linenr">25: </span>            {
<span class="linenr">26: </span>                <span style="color: #ff4040;">return</span> <span style="color: #7fffd4; font-weight: bold;">NULL</span>;
<span class="linenr">27: </span>            }
<span class="linenr">28: </span>
<span class="linenr">29: </span>            jn = jenv-&gt;NewByteArray((&amp;n)-&gt;size());
<span class="linenr">30: </span>            jenv-&gt;SetByteArrayRegion($result, 0, (&amp;n)-&gt;size(), (<span style="color: #ff4040;">const</span> <span style="color: #32cd32;">jbyte</span>*)(&amp;n)-&gt;c_str());
<span class="linenr">31: </span>        }
<span class="linenr">32: </span>        jenv-&gt;CallStaticVoidMethod(<span style="color: #7fffd4; font-weight: bold;">Swig</span>::jclass_exampl3JNI, <span style="color: #7fffd4; font-weight: bold;">Swig</span>::director_methids[0], swigjobj, jo, jn);
<span class="linenr">33: </span>        <span style="color: #ff4040;">if</span> (jenv-&gt;ExceptionCheck() == JNI_TRUE) <span style="color: #ff4040;">return</span> ;
<span class="linenr">34: </span>    } <span style="color: #ff4040;">else</span> {
<span class="linenr">35: </span>        SWIG_JavaThrowException(jenv, SWIG_JavaNullPointerException, <span style="color: #d78700;">"null upcall object"</span>);
<span class="linenr">36: </span>    }
<span class="linenr">37: </span>    <span style="color: #ff4040;">if</span> (swigjobj) jenv-&gt;DeleteLocalRef(swigjobj);
<span class="linenr">38: </span>}
<span class="linenr">39: </span>
<span class="linenr">40: </span>
<span class="linenr">41: </span><span style="color: #32cd32;">#ifdef</span> __cplusplus
<span class="linenr">42: </span><span style="color: #ff4040;">extern</span> <span style="color: #d78700;">"C"</span> {
<span class="linenr">43: </span><span style="color: #32cd32;">#endif</span>
<span class="linenr">44: </span>
<span class="linenr">45: </span>SWIGEXPORT <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">JNICALL</span> Java_exampl3JNI_Example3_1Updated(<span style="color: #32cd32;">JNIEnv</span> *<span style="color: #daa520;">jenv</span>, <span style="color: #32cd32;">jclass</span> <span style="color: #daa520;">jcls</span>, <span style="color: #32cd32;">jlong</span> <span style="color: #daa520;">jarg1</span>, <span style="color: #32cd32;">jobject</span> <span style="color: #daa520;">jarg1_</span>, <span style="color: #32cd32;">jbyteArray</span><span style="color: #0000ff; background-color: #ff0000; font-weight: bold;"> jarg2, jbyteArray jarg3) {</span>
<span class="linenr">46: </span>    <span style="color: #32cd32;">Example3</span> *<span style="color: #daa520;">arg1</span> = (<span style="color: #32cd32;">Example3</span> *) 0 ;
<span class="linenr">47: </span>    <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> *<span style="color: #daa520;">arg2</span> = 0 ;
<span class="linenr">48: </span>    <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> *<span style="color: #daa520;">arg3</span> = 0 ;
<span class="linenr">49: </span>
<span class="linenr">50: </span>    (<span style="color: #32cd32;">void</span>)jenv;
<span class="linenr">51: </span>    (<span style="color: #32cd32;">void</span>)jcls;
<span class="linenr">52: </span>    (<span style="color: #32cd32;">void</span>)jarg1_;
<span class="linenr">53: </span>    arg1 = *(<span style="color: #32cd32;">Example3</span> **)&amp;jarg1;
<span class="linenr">54: </span>    {
<span class="linenr">55: </span>        <span style="color: #32cd32;">jbyte</span>* <span style="color: #daa520;">dataPtr</span> = (<span style="color: #32cd32;">jbyte</span>*)<span style="color: #32cd32;">JCALL</span>(env-&gt;GetByteArrayElements(jarg2, 0));
<span class="linenr">56: </span>        <span style="color: #32cd32;">jsize</span>  <span style="color: #daa520;">dataSize</span> = JCALL11(env-&gt;GetArrayLength(jarg2));
<span class="linenr">57: </span>        <span style="color: #ff4040;">if</span> (olddata &amp;&amp; dataSize)
<span class="linenr">58: </span>        {
<span class="linenr">59: </span>            arg2 = <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #daa520;">string</span>(dataPtr, dataSize);
<span class="linenr">60: </span>        }
<span class="linenr">61: </span>    }
<span class="linenr">62: </span>    {
<span class="linenr">63: </span>        <span style="color: #32cd32;">jbyte</span>* <span style="color: #daa520;">dataPtr</span> = (<span style="color: #32cd32;">jbyte</span>*)<span style="color: #32cd32;">JCALL</span>(env-&gt;GetByteArrayElements(jarg3, 0));
<span class="linenr">64: </span>        <span style="color: #32cd32;">jsize</span>  <span style="color: #daa520;">dataSize</span> = JCALL11(env-&gt;GetArrayLength(jarg3));
<span class="linenr">65: </span>        <span style="color: #ff4040;">if</span> (olddata &amp;&amp; dataSize)
<span class="linenr">66: </span>        {
<span class="linenr">67: </span>            arg3 = <span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #daa520;">string</span>(dataPtr, dataSize);
<span class="linenr">68: </span>        }
<span class="linenr">69: </span>    }
<span class="linenr">70: </span>    (arg1)-&gt;Updated((<span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #ff4040;">const</span> &amp;)*arg2,(<span style="color: #7fffd4; font-weight: bold;">std</span>::<span style="color: #32cd32;">string</span> <span style="color: #ff4040;">const</span> &amp;)*arg3);
<span class="linenr">71: </span>}
<span class="linenr">72: </span>
<span class="linenr">73: </span>SWIGEXPORT <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">JNICALL</span> Java_exampl3JNI_swig_1module_1init(<span style="color: #32cd32;">JNIEnv</span> *<span style="color: #daa520;">jenv</span>, <span style="color: #32cd32;">jclass</span> <span style="color: #daa520;">jcls</span>) {
<span class="linenr">74: </span>    <span style="color: #32cd32;">int</span> <span style="color: #daa520;">i</span>;
<span class="linenr">75: </span>
<span class="linenr">76: </span>    <span style="color: #ff4040;">static</span> <span style="color: #ff4040;">struct</span> {
<span class="linenr">77: </span>        <span style="color: #ff4040;">const</span> <span style="color: #32cd32;">char</span> *<span style="color: #daa520;">method</span>;
<span class="linenr">78: </span>        <span style="color: #ff4040;">const</span> <span style="color: #32cd32;">char</span> *<span style="color: #daa520;">signature</span>;
<span class="linenr">79: </span>    } <span style="color: #daa520;">methods</span>[1] = {
<span class="linenr">80: </span>        {
<span class="linenr">81: </span>            <span style="color: #d78700;">"SwigDirector_Example3_Updated"</span>, <span style="color: #d78700;">"(LExample3;[B[B)V"</span>
<span class="linenr">82: </span>        }
<span class="linenr">83: </span>    };
<span class="linenr">84: </span>    <span style="color: #7fffd4; font-weight: bold;">Swig</span>::jclass_exampl3JNI = (<span style="color: #32cd32;">jclass</span>) jenv-&gt;NewGlobalRef(jcls);
<span class="linenr">85: </span>    <span style="color: #ff4040;">if</span> (!<span style="color: #7fffd4; font-weight: bold;">Swig</span>::jclass_exampl3JNI) <span style="color: #ff4040;">return</span>;
<span class="linenr">86: </span>    <span style="color: #ff4040;">for</span> (i = 0; i &lt; (<span style="color: #32cd32;">int</span>) (<span style="color: #ff4040;">sizeof</span>(methods)/<span style="color: #ff4040;">sizeof</span>(methods[0])); ++i) {
<span class="linenr">87: </span>        <span style="color: #7fffd4; font-weight: bold;">Swig</span>::director_methids[i] = jenv-&gt;GetStaticMethodID(jcls, methods[i].method, methods[i].signature);
<span class="linenr">88: </span>        <span style="color: #ff4040;">if</span> (!<span style="color: #7fffd4; font-weight: bold;">Swig</span>::director_methids[i]) <span style="color: #ff4040;">return</span>;
<span class="linenr">89: </span>    }
<span class="linenr">90: </span>}
<span class="linenr">91: </span>
<span class="linenr">92: </span>
<span class="linenr">93: </span><span style="color: #32cd32;">#ifdef</span> __cplusplus
<span class="linenr">94: </span>}
<span class="linenr">95: </span><span style="color: #32cd32;">#endif</span>
</pre>
</div>
</div>
</div>
</div>
</div>
